<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<meta name="generator" content=
"HTML Tidy for Linux (vers 6 November 2007), see www.w3.org">
<title>TeX Live in der TeX Collection 2008</title>
</head>
<body bgcolor="#FFFFFF" text="#000000" link="#AA0000" alink="#FF3300"
vlink="#330099">
<!-- *************************************************************** -->
<h1>Willkommen zu TeX Live in der TeX Collection 2008</h1>
<p>Die <strong>TeX Live</strong> Distribution auf einer DVD bietet
Ihnen ein komplettes TeX-System f&uuml;r eine Vielzahl von Unix,
Macintosh, Microsoft Windows, und anderen Plattformen. Enthalten sind
Programme zum Editieren, zum Satz, zur Bildschirmdarstellung, und zum
Ausdruck von TeX-Dokumenten in vielen Sprachen, sowie eine gro&szlig;e
Sammlung von TeX-Makros und eine abermals vergr&ouml;&szlig;erte Anzahl
von Fonts.</p>
<p>Die Distribution enth&auml;lt auch umfangreiche allgemeine
Dokumentationen zu TeX, sowie detaillierte Anleitungen zu den
vorhandenen Programmpaketen.</p>
<p>Informationen &uuml;ber Lizenzbedingungen finden Sie im
Wurzelverzeichnis der DVD in den Textdateien <a href=
"../LICENSE.TL">LICENSE.TL</a> und <a href=
"../LICENSE.CTAN">LICENSE.CTAN</a>.</p>
<!-- *************************************************************** -->
<h2>Zum Einstieg</h2>
<p>Wir empfehlen, da&szlig; Sie zun&auml;chst die "Anleitung zum TeX
Live-System" ausdrucken und lesen, bevor Sie mit der Installation
beginnen. Diese Anleitung enth&auml;lt Schritt f&uuml;r Schritt alle
notwendigen Informationen zur Benutzung der DVD sowie zur Installation
selbst. Dar&uuml;ber hinaus enth&auml;lt sie eine Erl&auml;uterung der
DVD Verzeichnisstruktur.</p>
<p>Sie finden die Anleitung in verschiedenen Dateiformaten im
Verzeichnis <a href=
"../texmf-doc/doc/german/texlive-de/">texmf-doc/doc/german/texlive-de/</a>:</p>
<ul>
<li><a href="../texmf-doc/doc/german/texlive-de/live.html">live.html
(HTML)</a></li>
<li><a href="../texmf-doc/doc/german/texlive-de/live.pdf">live.pdf
(PDF)</a></li>
</ul>
<p>&Uuml;bersetzungen in andere Sprachen finden Sie in weiteren
Unterverzeichnissen von <a href=
"../texmf-doc/doc/">texmf-doc/doc/</a>.</p>
<p>Die wichtigsten Neuerungen der diesj&auml;hrigen Ausgabe k&ouml;nnen
Sie im Abschnitt "Geschichtliches" am Ende der Anleitung nachlesen.</p>
<!-- *************************************************************** -->
<h2>Installation</h2>
<p>Das TeX Live-System auf der DVD ist direkt lauff&auml;hig, d. h. Sie
k&ouml;nnen die Programme ohne Installation von der gemounteten DVD
ausf&uuml;hren; Informationen hierzu finden Sie in der genannten
"Anleitung zum TeX Live-System".</p>
<p>Im Regelfall werden Sie jedoch das komplette TeX Live-System auf der
Festplatte installieren wollen. Zur Installation dient das neue Skript
<strong><tt>install-tl</tt></strong>, mit einer Fensteroberfl&auml;che
(GUI, Default f&uuml;r Windows) oder mit Text-Interface (Default
f&uuml;r alle anderen Betriebssysteme). Sie k&ouml;nnen den
gew&uuml;nschten Modus durch die Optionen <tt>-gui</tt> and
<tt>-no-gui</tt> einstellen.</p>
<p>Nach erfolgter Installation k&ouml;nnen Sie Updates und weitere
Konfigurationen mit Hilfe des Skripts <strong><tt>tlmgr</tt></strong>
(TeX Live Package Manager) durchf&uuml;hren, das ebenfalls wahlweise
mit Fenster- und Text-Interface gestartet werden kann.</p>
<h3>Details zum DVD-Format</h3>
<p>F&uuml;r Unix und MacOSX-Benutzer verwendet die DVD die "Rock Ridge"
Erweiterungen (z. B. lange Dateinamen) zum standardisierten
ISO-9660-Format. Unter Angabe dieses Formats lassen sie sich einfach
"mounten". Windows 9X/ME/NT/2K/XP-Benutzer sollten auf der DVD
ebenfalls lange Dateinamen sehen k&ouml;nnen, da auch die Microsoft
"Joliet" Erweiterungen unterst&uuml;tzt werden. Falls Sie nur
verk&uuml;rzte Namen sehen, k&ouml;nnen Sie die Programme leider nicht
direkt starten.</p>
<p>Alle, die eine TeX Live DVD selber brennen m&ouml;chten (und die
&uuml;ber einen Breitband-Internetanschluss verf&uuml;gen), finden
<a href="http://tug.org/texlive/acquire.html">Hinweise zum Download</a>
auf der TUG-Seite. 
<!-- *************************************************************** --></p>
<h2>Weitere TeX Distributionen auf der DVD</h2>
<p>Au&szlig;er TeX Live enth&auml;lt die DVD einen Abzug des
CTAN-Archivs, die Distributionen ProTeXt f&uuml;r Windows (siehe unten)
und MacTeX f&uuml;r MacOSX, sowie ein spezielles ConTeXt Verzeichnis.
Diese Pakete sind komplett unabh&auml;ngig vom TeX Live-System, mit zum
Teil von TeX Live abweichenden Lizenzbedingungen.</p>
<p>ProTeXt ist eine TeX-Distribution speziell f&uuml;r Microsoft
Windows, welche auf der <a href="http://www.miktex.org">MiKTeX</a>
Distribution basiert. Es befindet sich im Wurzelverzeichnis der TeX
Live DVD. ProTeXt erweitert MiKTeX um mehrere Programme, hat eine
vereinfachte Installation, und kommt mit eigenen
Installationsanweisungen. Auch ProTeXt kann direkt von der DVD
ausgef&uuml;hrt werden; es l&auml;&szlig;t sich ebenso auf Festplatte
installieren. Die ProTeXt Distribution ist vollst&auml;ndig
unabh&auml;ngig von TeX Live. Sie ist aus der TeX-Distribution des
Universit&auml;tsrechenzentrums der FernUniversit&auml;t Hagen
hervorgegangen.</p>
<p>DANTE-Mitglieder erhalten die TeX Collection DVD automatisch.</p>
<!-- *************************************************************** -->
<h2>Die Dokumentation</h2>
<p>Der gr&ouml;&szlig;te Teil der Dokumentation kann "online" gelesen
werden, noch bevor ein TeX-System tats&auml;chlich installiert wurde.
Diese Dokumente liegen normalerweise im HTML- und/oder im PDF-Format
vor. Zum Lesen der HTML-Dateien ben&ouml;tigen Sie einen Browser (z. B.
<a href="http://www.mozilla.org">Firefox</a>). Die PDF-Dateien
k&ouml;nnen Sie mit dem Adobe Reader betrachten, oder mit freien
Alternativen wie z. B. <a href=
"http://tug.org/applications/gv/">gv</a>, <a href=
"http://www.foolabs.com/xpdf/">xpdf</a>, oder <a href=
"http://blog.kowalczyk.info/software/sumatrapdf/">Sumatra PDF</a>.</p>
<ul>
<li><a href="../texmf-doc/doc/german/texlive-de/live.html"><strong>TeX
Live Dokumentation</strong></a> (HTML).</li>
<li><a href="../doc.html">Links zur gesamten in TeX Live enthaltenen
PDF und HTML Dokumentation</a>.</li>
<li>Die englische <a href=
"../texmf-doc/doc/english/FAQ-en/html/index.html">TeX FAQ (HTML)</a>
und <a href="../texmf-doc/doc/english/FAQ-en/newfaq.pdf">TeX FAQ
(PDF)</a> (h&auml;ufig gestellte Fragen).</li>
</ul>
<p>Schlie&szlig;lich ein paar interessante Links zu Informationen,
welche nicht in TeX Live enthalten sind:</p>
<ul>
<li><a href="http://tug.org/begin.html">http://tug.org/begin.html</a>
(englisch) - f&uuml;r alle, die neu mit TeX beginnen oder die sich
f&uuml;r einf&uuml;hrende Literatur interessieren.</li>
<li><a href="http://www.dante.de">http://www.dante.de</a> - die
Deutschsprachige Anwendervereinigung TeX e. V.</li>
<li><a href=
"http://tug.org/interest.html">http://tug.org/interest.html</a>
(englisch) - eine allgemeine Liste von Internet-Ressourcen zu TeX, mit
Verweisen zu Dokumentation, Systemen, Paketen, Fonts, und mehr.</li>
<li><a href=
"http://dante.ctan.org/CTAN/">http://dante.ctan.org/CTAN/</a> -
Einstiegspunkt zum "Comprehensive TeX Archive Network" (CTAN), dem
zentralen Umschlagplatz f&uuml;r alle TeX betreffenden Dinge.</li>
<li><a href=
"http://tug.org/usergroups.html">http://tug.org/usergroups.html</a> -
Liste aller weltweiten TeX Benutzergruppen mit Kontaktinformationen.
Wir empfehlen w&auml;rmstens, einer TeX Benutzergruppe Ihrer Wahl
beizutreten.</li>
</ul>
<b>Happy TeXing! - Viel Spa&szlig; mit TeX!</b> 
<!-- *************************************************************** -->
<hr>
<small>$Date: 2008/08/01 20:08:43 $; <a href=
"mailto:tex-live@tug.org">contact tex-live@tug.org</a>.</small> 
<!--$Id: readme.de.edit,v 1.161 2008/08/01 20:08:43 hahe Exp hahe $-->
</body>
</html>
